
translate japanese strings:

    old "여름의 끝에 피는 꽃"
    new "夏の終わりに咲く花"

    # game/script.rpy:37
    old "마지막 소원 컷신"
    new "最後の願い カットシーン"

    # game/script.rpy:102
    old "3차원"
    new "3次元"

    # game/script.rpy:102
    old "4차원"
    new "4次元"

    # game/script.rpy:102
    old "5차원"
    new "5次元"

    old "나"
    new "俺"

    old "소녀"
    new "少女"

    old "유미"
    new "ユミ"

    old "현지"
    new "ヒョンジ"
    
    old "가연"
    new "カヨン"

    old "남학생"
    new "男子生徒"

    # game/macro.rpy:122
    old "나 "
    new "俺 "

    # game/macro.rpy:123
    old "소녀 "
    new "少女 "

    old "유미 "
    # game/macro.rpy:124
    new "ユミ "

    old "본 작품에는 밝은 색상의 연출 및 눈부신 광원 효과, 반복되는 이미지 등이 포함되어 있습니다.\n극소수의 사람들은 영상에서 볼 수 있는 깜빡이는 빛과 같은 시각적 이미지에 노출될 경우 발작을 일으킬 수 있습니다.\n\n광과민성 간질 발작은 여러 증상으로 나타날 수 있습니다. 만약 작품을 감상할 때 현기증, 환각, 눈이나 근육의 경련 혹은 의식 장애(혼수상태),\n방향 감각 상실, 정신 착란, 일시적인 의식 상실 등과 같은 증상 중 한 가지라도 경험하게 되면, 작품을 재감상하기 전에 의사와 상담을 진행해 주시기를 바랍니다.\n\n만약 자신 혹은 자신의 가족이 이러한 경험을 겪은 적이 있는 경우, 작품을 감상하기 전에 먼저 의사와 상담해주세요." 
    new "このゲームにはフラッシュ演出、点滅効果などが含まれています。\n一部の人は点滅する光などのせいでてんかんや発作を起こす可能性があります。\n\nてんかん発作はさまざまな症状で現れます。もしゲームを遊んでるときに、めまい、幻覚、目や筋肉のけいれん、意識障害、\n方向感覚の消失、精神混乱、失神等の症状が出た場合，直ちに視聴をやめ医者に相談してください。\n\n過去に違う作品で同じような症状が出た場合はゲームを遊ぶ前に医者に相談してください。"

    old "숙지했으면 아무 키나 누르거나 클릭해 진행하기"
    new "理解したら任意のキーを押したり画面をクリックしたりして進みます。"